wrouwet/frdm-mcxa153-blinky/src/usb_main.c
/* USB CDC-ACM "virtual COM port" for the FRDM-MCXA153's second (target)
 * USB connector, wired to the MCX A153's own USB0 (KHCI) controller --
 * separate from the MCU-Link debug USB port.
 *
 * Behavior: accepts simple text commands over the CDC port and bridges
 * them to an LPI2C0 master transaction, so a host PC can drive I2C
 * devices on some other board through this one. See usage comment above
 * process_command() for the command syntax. Adapted from NXP's official
 * usb_device_cdc_vcom "bm" (bare-metal) example for this exact board,
 * with the debug-console/board/clock_config scaffolding stripped out and
 * replaced by the RTT logger already used by the blinky demo.
 */
#include <string.h>
#include "fsl_device_registers.h"
#include "fsl_lpi2c.h"
#include "fsl_port.h"
#include "rtt.h"

#include "usb_device_config.h"
#include "usb.h"
#include "usb_device.h"

#include "usb_device_class.h"
#include "usb_device_cdc_acm.h"
#include "usb_device_ch9.h"

#include "usb_device_descriptor.h"
#include "virtual_com.h"

/* Heartbeat LED (same red channel used by the blinky demo, GPIO3 pin 12,
 * active-low) so it's obvious the firmware is alive even with nothing
 * plugged into the USB port yet. Driven from SysTick so it keeps blinking
 * at a steady rate regardless of how busy the USB polling loop is. */
#define LED_RED_PIN 12U

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
void USB_DeviceClockInit(void);
void USB_DeviceIsrEnable(void);
usb_status_t USB_DeviceCdcVcomCallback(class_handle_t handle, uint32_t event, void *param);
usb_status_t USB_DeviceCallback(usb_device_handle handle, uint32_t event, void *param);

/*******************************************************************************
 * Variables
 ******************************************************************************/
extern usb_device_endpoint_struct_t g_UsbDeviceCdcVcomDicEndpoints[];
extern usb_device_class_struct_t g_UsbDeviceCdcVcomConfig;

usb_cdc_vcom_struct_t s_cdcVcom;

USB_DMA_INIT_DATA_ALIGN(USB_DATA_ALIGN_SIZE)
static uint8_t s_lineCoding[LINE_CODING_SIZE] = {
    (LINE_CODING_DTERATE >> 0U) & 0x000000FFU,
    (LINE_CODING_DTERATE >> 8U) & 0x000000FFU,
    (LINE_CODING_DTERATE >> 16U) & 0x000000FFU,
    (LINE_CODING_DTERATE >> 24U) & 0x000000FFU,
    LINE_CODING_CHARFORMAT,
    LINE_CODING_PARITYTYPE,
    LINE_CODING_DATABITS};

USB_DMA_INIT_DATA_ALIGN(USB_DATA_ALIGN_SIZE)
static uint8_t s_abstractState[COMM_FEATURE_DATA_SIZE] = {(STATUS_ABSTRACT_STATE >> 0U) & 0x00FFU,
                                                           (STATUS_ABSTRACT_STATE >> 8U) & 0x00FFU};

USB_DMA_INIT_DATA_ALIGN(USB_DATA_ALIGN_SIZE)
static uint8_t s_countryCode[COMM_FEATURE_DATA_SIZE] = {(COUNTRY_SETTING >> 0U) & 0x00FFU,
                                                         (COUNTRY_SETTING >> 8U) & 0x00FFU};

USB_DMA_NONINIT_DATA_ALIGN(USB_DATA_ALIGN_SIZE) static usb_cdc_acm_info_t s_usbCdcAcmInfo;
USB_DMA_NONINIT_DATA_ALIGN(USB_DATA_ALIGN_SIZE) static uint8_t s_currRecvBuf[DATA_BUFF_SIZE];
/* Sized independently of DATA_BUFF_SIZE (which is tied to the USB
 * endpoint's max packet size, 64 bytes, and only actually constrains
 * s_currRecvBuf below): USB_DeviceCdcAcmSend() already transparently
 * spans multiple packets for a longer buffer (see the ZLP-handling logic
 * in kUSB_DeviceCdcEventSendResponse), so the real ceiling on a reply is
 * just this array's size, not one packet. Needs to be big enough for the
 * longest reply process_command() can produce -- see I2C_CMD_MAX_DATA. */
#define SEND_BUF_SIZE 160U
USB_DMA_NONINIT_DATA_ALIGN(USB_DATA_ALIGN_SIZE) static uint8_t s_currSendBuf[SEND_BUF_SIZE];
volatile static uint32_t s_sendSize = 0;

/* Command line assembly. Bytes arrive here as USB packets (possibly one
 * character at a time, from an interactive terminal); s_lineReady is set
 * once a full line has accumulated, and cleared again by APPTask() once
 * it has built a reply. While a completed line is waiting to be answered,
 * no further receive is armed (simple half-duplex command/response). */
#define LINE_BUF_SIZE 128U
static char s_lineBuf[LINE_BUF_SIZE];
static uint32_t s_lineLen             = 0;
volatile static bool s_lineReady      = false;

static usb_device_class_config_struct_t s_cdcAcmConfig[1] = {{
    USB_DeviceCdcVcomCallback,
    0,
    &g_UsbDeviceCdcVcomConfig,
}};

static usb_device_class_config_list_struct_t s_cdcAcmConfigList = {
    s_cdcAcmConfig,
    USB_DeviceCallback,
    1,
};

/*******************************************************************************
 * Board / clock / IRQ glue
 ******************************************************************************/
void USB0_IRQHandler(void)
{
    USB_DeviceKhciIsrFunction(s_cdcVcom.deviceHandle);
}

/* Bumped once per SysTick period (~250 ms, see the calibration note in
 * LED_Init()) so other code can bound a wait without needing an accurate
 * millisecond time base -- good enough for "give up eventually", not for
 * precise timing. */
volatile static uint32_t s_tickCount = 0;

void SysTick_Handler(void)
{
    GPIO3->PTOR = (1U << LED_RED_PIN);
    s_tickCount++;
}

static void LED_Init(void)
{
    SYSCON->CLKUNLOCK &= ~SYSCON_CLKUNLOCK_UNLOCK_MASK;
    MRCC0->MRCC_GLB_CC1_SET  = MRCC_MRCC_GLB_CC1_PORT3_MASK | MRCC_MRCC_GLB_CC1_GPIO3_MASK;
    MRCC0->MRCC_GLB_RST1_SET = MRCC_MRCC_GLB_RST1_PORT3_MASK | MRCC_MRCC_GLB_RST1_GPIO3_MASK;
    SYSCON->CLKUNLOCK |= SYSCON_CLKUNLOCK_UNLOCK_MASK;

    PORT3->PCR[LED_RED_PIN] = PORT_PCR_MUX(0U);
    GPIO3->PSOR             = (1U << LED_RED_PIN); /* off (active-low) */
    GPIO3->PDDR |= (1U << LED_RED_PIN);

    /* Neither SystemCoreClock nor CLOCK_GetCoreSysClkFreq() (48 MHz) match
     * the clock that actually drives SysTick's CLKSOURCE=1 "processor
     * clock" input on this chip/board -- both produced a visibly faster
     * blink than intended. This reload was calibrated by eye against the
     * real board to give a ~2 Hz blink (full on/off cycle twice a second).
     * Note SysTick->LOAD is only 24 bits wide (max ~16.7M), so any fix
     * using a queried clock value needs a software tick counter rather
     * than a single reload once the desired period gets much longer. */
    SysTick_Config(12000000UL);
}

void USB_DeviceClockInit(void)
{
    RESET_PeripheralReset(kUSB0_RST_SHIFT_RSTn);
    CLOCK_EnableUsbfsClock();
}

/* LPI2C0 master, routed to PORT3 pins 27 (SCL) / 28 (SDA) via mux ALT2,
 * which fan out to the board's mikroBUS header (J5) and Pmod connector
 * (J7, unpopulated) -- confirmed against NXP's own lpi2c/polling_b2b
 * example for this board. Clocked from the 12 MHz FRO (undivided), same
 * clock-attach pattern as CLOCK_EnableUsbfsClock() uses for USB. */
#define I2C_MASTER_CLOCK_HZ 12000000UL
#define I2C_MASTER_BAUD_HZ  100000U

