wrouwet/frdm-mcxa153-blinky/src/usb_main.c
static void I2C_Init(void)
{
    CLOCK_EnableClock(kCLOCK_GateLPI2C0);
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    RESET_ReleasePeripheralReset(kLPI2C0_RST_SHIFT_RSTn);
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);

    CLOCK_AttachClk(kFRO12M_to_LPI2C0);
    CLOCK_SetClockDiv(kCLOCK_DivLPI2C0, 1U);

    /* Enable the pins' internal pull-ups (matching NXP's own lpi2c
     * reference config for these pins). I2C needs pull-ups to work at
     * all; the internal ones are weak (~kOhm range, fine at 100 kHz) and
     * mainly matter for bench-testing this bus with nothing wired to it
     * yet -- an external target board will normally supply its own,
     * stronger pull-ups once connected. */
    const port_pin_config_t i2cPinConfig = {
        .pullSelect          = kPORT_PullUp,
        .pullValueSelect     = kPORT_LowPullResistor,
        .slewRate            = kPORT_FastSlewRate,
        .passiveFilterEnable = kPORT_PassiveFilterDisable,
        .openDrainEnable     = kPORT_OpenDrainDisable,
        .driveStrength       = kPORT_LowDriveStrength,
        .driveStrength1      = kPORT_NormalDriveStrength,
        .mux                 = kPORT_MuxAlt2,
        .inputBuffer         = kPORT_InputBufferEnable,
        .invertInput         = kPORT_InputNormal,
        .lockRegister        = kPORT_UnlockRegister,
    };
    PORT_SetPinConfig(PORT3, 27U, &i2cPinConfig);
    PORT_SetPinConfig(PORT3, 28U, &i2cPinConfig);

    lpi2c_master_config_t config;
    LPI2C_MasterGetDefaultConfig(&config);
    config.baudRate_Hz = I2C_MASTER_BAUD_HZ;
    LPI2C_MasterInit(LPI2C0, &config, I2C_MASTER_CLOCK_HZ);
}

/* Some I2C targets (e.g. an OpenBIC controller speaking IPMB) don't
 * answer a request by being read from -- they reply by becoming bus
 * MASTER themselves and writing the response out to whatever
 * "requester address" was named in the request. To see that response,
 * we have to temporarily become an I2C SLAVE ourselves at that address
 * and catch the incoming write, then switch back to master mode
 * afterwards. Polled rather than interrupt-driven, matching the rest of
 * this file's fully-synchronous per-command design. */
static bool I2C_SlaveWaitForWrite(uint8_t ourAddr, uint8_t *buf, uint32_t bufMax, uint32_t *outLen,
                                   uint32_t timeoutTicks)
{
    LPI2C_MasterEnable(LPI2C0, false);

    lpi2c_slave_config_t slaveConfig;
    LPI2C_SlaveGetDefaultConfig(&slaveConfig);
    slaveConfig.address0 = ourAddr;
    LPI2C_SlaveInit(LPI2C0, &slaveConfig, I2C_MASTER_CLOCK_HZ);

    uint32_t len       = 0;
    bool sawAddress    = false;
    bool gotStop       = false;
    uint32_t startTick = s_tickCount;

    while ((s_tickCount - startTick) <= timeoutTicks)
    {
        uint32_t status = LPI2C_SlaveGetStatusFlags(LPI2C0);

        if (0U != (status & (uint32_t)kLPI2C_SlaveAddressValidFlag))
        {
            sawAddress = true;
            (void)LPI2C0->SASR; /* reading SASR clears AVF */
        }

        if (0U != (status & (uint32_t)kLPI2C_SlaveRxReadyFlag))
        {
            uint32_t data = LPI2C0->SRDR;
            if ((0U == (data & LPI2C_SRDR_RXEMPTY_MASK)) && (len < bufMax))
            {
                buf[len++] = (uint8_t)(data & LPI2C_SRDR_DATA_MASK);
            }
        }

        if (0U != (status & (uint32_t)kLPI2C_SlaveStopDetectFlag))
        {
            LPI2C_SlaveClearStatusFlags(LPI2C0, (uint32_t)kLPI2C_SlaveStopDetectFlag);
            if (sawAddress)
            {
                gotStop = true;
                break;
            }
        }
    }

    LPI2C_SlaveEnable(LPI2C0, false);
    I2C_Init(); /* back to master mode, with pins/clocks freshly reconfigured */

    rtt_puts(sawAddress ? "slave: address was matched\r\n" : "slave: no address match seen\r\n");

    *outLen = len;
    return gotStop;
}

/* This driver has no automatic bus-recovery: if a transfer times out
 * (e.g. the target device is holding SCL or SDA low mid-transaction), the
 * bus stays wedged and every subsequent transfer -- even a plain write --
 * keeps failing until something forces the lines free again. This is the
 * standard I2C recovery procedure: temporarily drive the pins as plain
 * GPIO, clock SCL up to 9 times (enough for any slave stuck mid-byte to
 * finish and release SDA), then drive a manual STOP condition, before
 * switching the pins back to LPI2C0 and reinitializing the peripheral. */
static void I2C_BusRecover(void)
{
    PORT3->PCR[27] = PORT_PCR_MUX(0U) | PORT_PCR_PE_MASK | PORT_PCR_PS_MASK; /* SCL, GPIO, pull-up */
    PORT3->PCR[28] = PORT_PCR_MUX(0U) | PORT_PCR_PE_MASK | PORT_PCR_PS_MASK; /* SDA, GPIO, pull-up */

    GPIO3->PDDR |= (1U << 27);  /* SCL: output */
    GPIO3->PDDR &= ~(1U << 28); /* SDA: input, so we can see when it's released */
    GPIO3->PSOR = (1U << 27);   /* SCL idle high */

    for (int i = 0; i < 9; i++)
    {
        if (0U != (GPIO3->PDIR & (1U << 28)))
        {
            break; /* SDA already released */
        }
        GPIO3->PCOR = (1U << 27);
        for (volatile int d = 0; d < 200; d++)
        {
        }
        GPIO3->PSOR = (1U << 27);
        for (volatile int d = 0; d < 200; d++)
        {
        }
    }

    /* Manual STOP condition: SDA low-to-high while SCL is high. */
    GPIO3->PDDR |= (1U << 28);
    GPIO3->PCOR = (1U << 28);
    for (volatile int d = 0; d < 200; d++)
    {
    }
    GPIO3->PSOR = (1U << 27);
    for (volatile int d = 0; d < 200; d++)
    {
    }
    GPIO3->PSOR = (1U << 28);
    for (volatile int d = 0; d < 200; d++)
    {
    }
    GPIO3->PDDR &= ~(1U << 28);

    I2C_Init();
}

/* NAK is a normal "no device at this address" response and doesn't mean
 * the bus is wedged, so only run recovery for the other failure classes. */
static void i2c_recover_if_needed(status_t status)
{
    if (status != kStatus_Success && status != kStatus_LPI2C_Nak)
    {
        I2C_BusRecover();
    }
}

void USB_DeviceIsrEnable(void)
{
    uint8_t usbDeviceKhciIrq[] = USBFS_IRQS;
    uint8_t irqNumber          = usbDeviceKhciIrq[CONTROLLER_ID - kUSB_ControllerKhci0];

