wrouwet/frdm-mcxa153-blinky/src/usb_main.c
    NVIC_SetPriority((IRQn_Type)irqNumber, USB_DEVICE_INTERRUPT_PRIORITY);
    EnableIRQ((IRQn_Type)irqNumber);
}

/*******************************************************************************
 * UART-to-I2C command bridge
 *
 * Line-based text protocol, one command per line (LF or CRLF terminated).
 * <addr> is a 7-bit I2C address, <byte> a data byte -- both 1-2 hex
 * digits, no "0x" prefix. <n> is a decimal byte count.
 *
 *   W <addr> <byte> [byte ...]     write bytes to <addr>
 *   R <addr> <n>                   read <n> bytes from <addr>
 *   X <addr> <n> <byte> [byte ...] write bytes, repeated-start, then
 *                                  read <n> bytes (register-read pattern)
 *   S                              scan the bus, list responding addresses
 *   I <addr> <ourAddr> <byte> [byte ...]
 *                                  write bytes to <addr> (e.g. an IPMB
 *                                  request), then briefly become an I2C
 *                                  slave at <ourAddr> and capture whatever
 *                                  the target writes back -- for devices
 *                                  (like OpenBIC/IPMB) that respond by
 *                                  becoming bus master themselves rather
 *                                  than being read from
 *   L <ourAddr>                    like I, but with no write of our own
 *                                  first -- just listen; useful for
 *                                  independently testing the slave-mode
 *                                  RX path against some other master
 *
 * Replies (also LF/CRLF terminated):
 *   OK                             W succeeded
 *   OK <byte> [byte ...]           R/X/I/L succeeded, with the data
 *   OK <addr> [addr ...]           S succeeded (may be empty if nothing found)
 *   ERR <reason>                   something went wrong
 *
 * Example: reading 2 bytes starting at register 0x00 of a device at 0x50:
 *   > X 50 2 00
 *   < OK a1 b2
 ******************************************************************************/
/* Ceiling on how much data a single command can move, both what W/X can
 * write and what R/X/I/L can read/capture. Constrained only by
 * SEND_BUF_SIZE now ("OK" + N * " xx" + "\r\n" <= SEND_BUF_SIZE), not by
 * a single USB packet -- multi-packet replies work fine (see
 * SEND_BUF_SIZE's comment). Sized with real IPMI traffic in mind: a
 * smaller 16 silently truncated a standard 18-byte Get Device ID
 * response, dropping the trailing checksum byte and making every
 * response look checksum-invalid even though the actual exchange was
 * fine (caught 2026-08-24); 32 leaves headroom for that plus the longer
 * variant with an Auxiliary Firmware Revision field (22 bytes). */
#define I2C_CMD_MAX_DATA 32U

static const char *skip_spaces(const char *p)
{
    while (*p == ' ')
    {
        p++;
    }
    return p;
}

static bool parse_hex_u32(const char **pp, uint32_t *out, uint32_t maxDigits)
{
    const char *p = skip_spaces(*pp);
    uint32_t value = 0;
    uint32_t ndig  = 0;
    while (ndig < maxDigits)
    {
        char c = *p;
        uint32_t digit;
        if (c >= '0' && c <= '9')
        {
            digit = (uint32_t)(c - '0');
        }
        else if (c >= 'a' && c <= 'f')
        {
            digit = (uint32_t)(c - 'a' + 10);
        }
        else if (c >= 'A' && c <= 'F')
        {
            digit = (uint32_t)(c - 'A' + 10);
        }
        else
        {
            break;
        }
        value = (value << 4) | digit;
        ndig++;
        p++;
    }
    if (ndig == 0U)
    {
        return false;
    }
    *out = value;
    *pp  = p;
    return true;
}

static bool parse_dec_u32(const char **pp, uint32_t *out)
{
    const char *p = skip_spaces(*pp);
    uint32_t value = 0;
    uint32_t ndig  = 0;
    while (*p >= '0' && *p <= '9')
    {
        value = (value * 10U) + (uint32_t)(*p - '0');
        p++;
        ndig++;
    }
    if (ndig == 0U)
    {
        return false;
    }
    *out = value;
    *pp  = p;
    return true;
}

static uint32_t append_str(char *buf, uint32_t pos, const char *s)
{
    while (*s)
    {
        buf[pos++] = *s++;
    }
    return pos;
}

static uint32_t append_hex_byte(char *buf, uint32_t pos, uint8_t v)
{
    static const char hexdigits[] = "0123456789abcdef";
    buf[pos++]                    = hexdigits[(v >> 4) & 0xFU];
    buf[pos++]                    = hexdigits[v & 0xFU];
    return pos;
}

/* I2C_RETRY_TIMES is overridden (see Makefile) to a finite value so a
 * floating/unwired bus (no target attached, no pull-ups) fails fast with
 * kStatus_LPI2C_Timeout instead of hanging the whole command loop forever. */
static const char *i2c_error_str(status_t status)
{
    switch (status)
    {
        case kStatus_LPI2C_Nak:
            return "ERR nak";
        case kStatus_LPI2C_Timeout:
            return "ERR timeout (bus never went idle -- check wiring/pull-ups)";
        case kStatus_LPI2C_PinLowTimeout:
            return "ERR pin low timeout (SCL or SDA stuck low -- check wiring/short/target power)";
        case kStatus_LPI2C_ArbitrationLost:
            return "ERR arbitration lost (bus contention -- another master, or SDA/SCL swapped/shorted?)";
        case kStatus_LPI2C_BitError:
            return "ERR bit error (bus noise or a wire not making contact)";
        case kStatus_LPI2C_FifoError:
            return "ERR fifo error";
        case kStatus_LPI2C_Busy:
            return "ERR busy";
        default:
            return "ERR i2c (unknown status)";
    }
}

/* Processes one received command line (not including its line ending) and
 * writes a reply (not including its line ending) into outBuf. Returns the
 * reply length. outBuf must be at least DATA_BUFF_SIZE bytes. */
static uint32_t process_command(const char *line, uint32_t lineLen, char *outBuf)
{
    const char *p = skip_spaces(line);
    char cmd      = *p;
    if (cmd >= 'a' && cmd <= 'z')
    {
        cmd = (char)(cmd - 'a' + 'A');
    }
    p++;

    if (cmd != 'S' && cmd != 'W' && cmd != 'R' && cmd != 'X' && cmd != 'I' && cmd != 'L')
    {
        return append_str(outBuf, 0, "ERR bad command");
    }

    if (cmd == 'S')
    {
        /* Probe each address with a zero-length write, the standard I2C
         * scan idiom: it's just a START + address byte + STOP, and
         * LPI2C_MasterTransferBlocking() correctly waits for and reports
         * a NAK. (The lower-level LPI2C_MasterStart() alone does *not* --
         * it only enqueues the START command into the hardware FIFO and
         * returns, without waiting to see whether the address was
         * actually acknowledged on the bus -- so it can't be used to
         * detect a NAK by itself.)
         *
         * Unlike every other command below, this loop originally never
         * called i2c_recover_if_needed() on a failed probe -- meaning a
         * scan issued while the bus happened to be wedged (e.g. right
         * after two closely-spaced master writes collided, one seeing
         * arbitration loss) silently came back completely empty and
         * *stayed* wedged, since nothing here ever recovered it. Every
         * other command (W/R/X/I) already self-heals this way; a plain
         * scan reasonably needs to as well, since it's often the first
         * thing run in a new session and has no other error path to
         * surface the problem through (found 2026-08-24 via the test
         * framework: a scan run immediately after a deliberate
         * back-to-back-write stress test came back empty, while a
         * subsequent W-based command succeeded normally because it, not
         * the scan, happened to trigger recovery). */
        uint32_t pos = append_str(outBuf, 0, "OK");
        for (uint32_t addr = 0x08U; addr <= 0x77U; addr++)
        {
            lpi2c_master_transfer_t probe = {0};
            probe.slaveAddress             = (uint16_t)addr;
            probe.direction                = kLPI2C_Write;
            probe.flags                    = kLPI2C_TransferDefaultFlag;

            status_t status = LPI2C_MasterTransferBlocking(LPI2C0, &probe);
            if (kStatus_Success == status)
            {
                outBuf[pos++] = ' ';
                pos           = append_hex_byte(outBuf, pos, (uint8_t)addr);
            }
            else
            {
                i2c_recover_if_needed(status);
            }
        }
        return pos;
    }

    if (cmd == 'L')
    {
        /* Listen only, with no write of our own first -- useful on its own
         * for independently verifying the slave-mode RX path (e.g. against
         * a master that isn't us), decoupled from whatever an "I" command's
         * own write step might be doing. */
        uint32_t ourAddr;
        if (!parse_hex_u32(&p, &ourAddr, 2U) || ourAddr > 0x7FU)
        {
            return append_str(outBuf, 0, "ERR bad address");
        }

