wrouwet/frdm-mcxa153-blinky/src/usb_main.c
        uint8_t rdata[I2C_CMD_MAX_DATA];
        uint32_t rlen = 0;
        bool got = I2C_SlaveWaitForWrite((uint8_t)ourAddr, rdata, I2C_CMD_MAX_DATA, &rlen, 16U);
        if (!got)
        {
            return append_str(outBuf, 0, "ERR timeout waiting for a write");
        }

        uint32_t pos = append_str(outBuf, 0, "OK");
        for (uint32_t i = 0; i < rlen; i++)
        {
            outBuf[pos++] = ' ';
            pos           = append_hex_byte(outBuf, pos, rdata[i]);
        }
        return pos;
    }

    uint32_t addr;
    if (!parse_hex_u32(&p, &addr, 2U) || addr > 0x7FU)
    {
        return append_str(outBuf, 0, "ERR bad address");
    }

    if (cmd == 'W' || cmd == 'X')
    {
        uint32_t readCount = 0;
        if (cmd == 'X')
        {
            if (!parse_dec_u32(&p, &readCount) || readCount > I2C_CMD_MAX_DATA)
            {
                return append_str(outBuf, 0, "ERR bad count");
            }
        }

        uint8_t data[I2C_CMD_MAX_DATA];
        uint32_t dataLen = 0;
        uint32_t byte;
        while (dataLen < I2C_CMD_MAX_DATA && parse_hex_u32(&p, &byte, 2U))
        {
            data[dataLen++] = (uint8_t)byte;
        }

        lpi2c_master_transfer_t xfer = {0};
        xfer.slaveAddress             = (uint16_t)addr;
        xfer.direction                = kLPI2C_Write;
        xfer.data                     = data;
        xfer.dataSize                 = dataLen;
        xfer.flags                    = (cmd == 'X') ? kLPI2C_TransferNoStopFlag : kLPI2C_TransferDefaultFlag;

        status_t status = LPI2C_MasterTransferBlocking(LPI2C0, &xfer);
        if (status != kStatus_Success)
        {
            i2c_recover_if_needed(status);
            return append_str(outBuf, 0, i2c_error_str(status));
        }

        if (cmd == 'W')
        {
            return append_str(outBuf, 0, "OK");
        }

        uint8_t rdata[I2C_CMD_MAX_DATA];
        lpi2c_master_transfer_t rxfer = {0};
        rxfer.slaveAddress             = (uint16_t)addr;
        rxfer.direction                = kLPI2C_Read;
        rxfer.data                     = rdata;
        rxfer.dataSize                 = readCount;
        rxfer.flags                    = kLPI2C_TransferRepeatedStartFlag;

        status = LPI2C_MasterTransferBlocking(LPI2C0, &rxfer);
        if (status != kStatus_Success)
        {
            i2c_recover_if_needed(status);
            return append_str(outBuf, 0, i2c_error_str(status));
        }

        uint32_t pos = append_str(outBuf, 0, "OK");
        for (uint32_t i = 0; i < readCount; i++)
        {
            outBuf[pos++] = ' ';
            pos           = append_hex_byte(outBuf, pos, rdata[i]);
        }
        return pos;
    }

    if (cmd == 'R')
    {
        uint32_t count;
        if (!parse_dec_u32(&p, &count) || count > I2C_CMD_MAX_DATA)
        {
            return append_str(outBuf, 0, "ERR bad count");
        }

        uint8_t rdata[I2C_CMD_MAX_DATA];
        lpi2c_master_transfer_t xfer = {0};
        xfer.slaveAddress             = (uint16_t)addr;
        xfer.direction                = kLPI2C_Read;
        xfer.data                     = rdata;
        xfer.dataSize                 = count;
        xfer.flags                    = kLPI2C_TransferDefaultFlag;

        status_t status = LPI2C_MasterTransferBlocking(LPI2C0, &xfer);
        if (status != kStatus_Success)
        {
            i2c_recover_if_needed(status);
            return append_str(outBuf, 0, i2c_error_str(status));
        }

        uint32_t pos = append_str(outBuf, 0, "OK");
        for (uint32_t i = 0; i < count; i++)
        {
            outBuf[pos++] = ' ';
            pos           = append_hex_byte(outBuf, pos, rdata[i]);
        }
        return pos;
    }

    if (cmd == 'I')
    {
        uint32_t ourAddr;
        if (!parse_hex_u32(&p, &ourAddr, 2U) || ourAddr > 0x7FU)
        {
            return append_str(outBuf, 0, "ERR bad requester address");
        }

        uint8_t data[I2C_CMD_MAX_DATA];
        uint32_t dataLen = 0;
        uint32_t byte;
        while (dataLen < I2C_CMD_MAX_DATA && parse_hex_u32(&p, &byte, 2U))
        {
            data[dataLen++] = (uint8_t)byte;
        }

        lpi2c_master_transfer_t xfer = {0};
        xfer.slaveAddress             = (uint16_t)addr;
        xfer.direction                = kLPI2C_Write;
        xfer.data                     = data;
        xfer.dataSize                 = dataLen;
        xfer.flags                    = kLPI2C_TransferDefaultFlag;

        status_t status = LPI2C_MasterTransferBlocking(LPI2C0, &xfer);
        if (status != kStatus_Success)
        {
            i2c_recover_if_needed(status);
            return append_str(outBuf, 0, i2c_error_str(status));
        }

        uint8_t rdata[I2C_CMD_MAX_DATA];
        uint32_t rlen = 0;
        /* ~1s: a handful of SysTick periods (~250 ms each, see LED_Init()). */
        bool got = I2C_SlaveWaitForWrite((uint8_t)ourAddr, rdata, I2C_CMD_MAX_DATA, &rlen, 16U);
        if (!got)
        {
            return append_str(outBuf, 0, "ERR timeout waiting for response");
        }

        uint32_t pos = append_str(outBuf, 0, "OK");
        for (uint32_t i = 0; i < rlen; i++)
        {
            outBuf[pos++] = ' ';
            pos           = append_hex_byte(outBuf, pos, rdata[i]);
        }
        return pos;
    }

    (void)lineLen;
    return append_str(outBuf, 0, "ERR bad command");
}

/*******************************************************************************
 * CDC ACM class callback (line coding, control line state, rx/tx events)
 ******************************************************************************/
usb_status_t USB_DeviceCdcVcomCallback(class_handle_t handle, uint32_t event, void *param)
{
    uint32_t len;
    uint8_t *uartBitmap;
    usb_device_cdc_acm_request_param_struct_t *acmReqParam;
    usb_device_endpoint_callback_message_struct_t *epCbParam;
    usb_status_t error          = kStatus_USB_InvalidRequest;
    usb_cdc_acm_info_t *acmInfo = &s_usbCdcAcmInfo;
    acmReqParam                 = (usb_device_cdc_acm_request_param_struct_t *)param;
    epCbParam                   = (usb_device_endpoint_callback_message_struct_t *)param;

